tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'caskroom/drivers'
tap 'universal-ctags/universal-ctags'
tap 'mkchoi212/fac'

# Cool System Stuff
cask 'aerial' # Screensaver videos

# Fonts
cask 'font-source-code-pro'

# Security
cask 'authy'
cask 'private-internet-access'
brew 'pinentry-mac'
brew 'gnupg'
cask 'keybase'
brew 'lastpass-cli', args: ['with-pinentry', 'with-doc']
mas 'LastPass', id: 926036361

# Terminal
brew 'ack'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'coreutils'
brew 'dos2unix'
brew 'fzy'
brew 'jq'
brew 'nmap'
brew 'readline'
brew 'ruby'
brew 'tldr'
brew 'unar'
brew 'vim'

# Development
cask 'atom'
cask 'ccmenu'
brew 'cmake'
cask 'docker'
brew 'fac'
brew 'git'
cask 'google-cloud-sdk'
brew 'hub'
brew 'nvm'
cask 'postman'
cask 'p4merge'
brew 'python'
brew 'tig'
brew 'tmate'
brew 'tmux'
brew 'universal-ctags', args: ['HEAD']

cask 'google-chrome'
cask 'brave-browser'
cask 'firefox'

# Design
cask 'pencil'

# Text Editing
mas 'keynote', id: 409183694
mas 'numbers', id: 409203825
mas 'pages', id: 409201541

# Utility Apps
cask 'disk-inventory-x'
cask 'dropbox'
brew 'fzf'
cask 'gitter'
cask 'google-backup-and-sync'
cask 'google-drive'
mas 'LastPass', id: 926036361
brew 'lastpass-cli'
mas 'monosnap-screenshot-editor', id: 540348655
cask 'slack'
cask 'spotify'
brew 'task'
brew 'tree'
cask 'the-unarchiver'
