tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'universal-ctags/universal-ctags'
tap 'heroku/brew'
tap 'espanso/espanso'

# Cool System Stuff
cask 'aerial' # Screensaver videos

# Fonts
brew 'svn'
cask 'font-source-code-pro'

# Security
cask 'authy'
cask 'nordvpn'
brew 'pinentry-mac'
brew 'gnupg'
cask 'keybase'
cask '1password'

# Terminal
brew 'ack'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'coreutils'
brew 'dos2unix'
brew 'fzy'
brew 'jq'
brew 'nmap'
brew 'readline'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'the_silver_searcher'
brew 'tldr'
brew 'unar'
brew 'vim'

# Development
cask 'bbedit'
cask 'ccmenu'
brew 'cmake'
cask 'docker'
brew 'docker-machine'
brew 'gh'
brew 'git'
brew 'git-lfs'
cask 'google-cloud-sdk'
brew 'hub'
cask 'intellij-idea'
brew 'nvm'
brew 'yarn'
cask 'postman'
cask 'proxyman'
brew 'pyenv'
brew 'pipenv'
brew 'redis'
brew 'tig'
brew 'tmate'
brew 'tmux'
cask 'visual-studio-code'

cask 'google-chrome'
cask 'firefox'

# Text Editing
mas 'keynote', id: 409183694
mas 'numbers', id: 409203825
mas 'pages', id: 409201541

# Utility Apps
cask '1password'
cask 'alfred'
cask 'alt-tab'
cask 'balenaetcher'
cask 'cleanshot'
cask 'discord'
cask 'disk-inventory-x'
cask 'elgato-control-center'
cask 'elgato-stream-deck'
cask 'espanso'
brew 'fzf'
# cask 'gimp'
cask 'google-drive'
# cask 'inkscape'
cask 'logitech-control-center'
cask 'maccy'
cask 'miro'
cask 'notion'
cask 'rectangle'
cask 'signal'
cask 'slack'
# cask 'spectrum'
cask 'spotify'
cask 'steam'
# brew 'task'
brew 'tree'
cask 'the-unarchiver'
cask 'zoom'
